var sysConfig = { "系统名称": "上林县国土移动综合平台", "服务类型": "arcserverquery", "地区名": "上林", "地区拼音": "dianbai", "中心等级": 12, "地名地址服务": "http://219.159.239.217:6080/arcgis/rest/services/A01%E5%9F%BA%E7%A1%80%E6%95%B0%E6%8D%AE/%E4%B8%8A%E6%9E%97%E5%8E%BF%E5%9C%B0%E5%90%8D%E5%9C%B0%E5%9D%80%E7%82%B9/MapServer/0", "地名地址替换文字": "上林", "地名地址地名字段": "NAME", "地名地址地址字段": "NAME", "地名地址图层名": "地名地址数据", "版权": "技术支持：南宁市国土测绘地理信息中心", "中心经度": 108.60012624483261, "中心纬度": 23.433310822511334, "username": "管理员" };

var CaseSubTypeList =
    {
        "市容环境": "私搭乱建、废弃家具设备、水域秩序问題、暴露垃圾、非装饰性树挂、焚烧垃圾、树叶、积存垃圾渣土、道路破损、油烟污染、道路不洁、河堤破损、动物尸体清理、水域不洁、道路遗撒、擅自词养家禽家畜、绿地脏乱、建筑物外立面不洁、其它市容环境问題、废弃车辆",
        "宣传广告": "非法小广告、占道广告牌、广告招牌破损、违章张贴悬挂广告牌匾、街头散发广告",
        "施工管理": "施工扰民、施工庞宑料、无证掘路、工地扬尘、施工占道、其它施工管埋问题",
        "突发事件": "路面塌陷、热力管遏破裂、群发性事件、自来水管破裂、道路秧水、燃气存储破裂、燃气管道破裂、道路表面结冰、其它突发事件、下水道堵塞或破损、架空线缆损坏",
        "街面秩序": "无照经营游商、非机动车乱停放、沿街晾挂、流浪乞讨、乱堆物堆料、非法出版物销售、占道废品收购、商业噪音、空调室外机低挂、店外经营、黑车拉客、其它街面秩序问题、机动车乱停放、露天烧烤",
        "扩展事件": "占道从事非交通活动、克隆出租汽车、道路泼洒渣土、生活垃圾、违法违规道路开口、出租汽车营运违章、投诉和失物、违规设置防盜笼、广告牌遮挡交通标志/标牌、信号灯/路灯不亮，开（关）灯过早/过晩，白天高亮度条件下过度亮灯、交通秩序混乱、公共停车场擅自停止使用或改为他用、车辆冒黑烟"
    };
var CaseTypeList = ["市容环境", "宣传广告", "施工管理", "突发事件", "街面秩序", "扩展事件"];

function GetCaseTypeList()
{
    var data = [];
    for (var i = 0; i < CaseTypeList.length;i++)
    {
        data[i]={id:CaseTypeList[i]};
    }
    return data;
}

function GetCaseSubTypeList(type) {
    var data = [];
    var d = CaseSubTypeList[type].split('、');
    for (var i = 0; i < d.length; i++) {
        data[i] = { id: d[i] };
    }
    return data;
}

