var sysConfig = { "系统名称": "上林县国土移动综合平台", "服务类型": "arcserverquery", "地区名": "上林", "地区拼音": "dianbai", "中心等级": 12, "地名地址服务": "http://219.159.239.217:6080/arcgis/rest/services/A01%E5%9F%BA%E7%A1%80%E6%95%B0%E6%8D%AE/%E4%B8%8A%E6%9E%97%E5%8E%BF%E5%9C%B0%E5%90%8D%E5%9C%B0%E5%9D%80%E7%82%B9/MapServer/0", "地名地址替换文字": "上林", "地名地址地名字段": "NAME", "地名地址地址字段": "NAME", "地名地址图层名": "地名地址数据", "版权": "技术支持：南宁市国土测绘地理信息中心", "中心经度": 108.60012624483261, "中心纬度": 23.433310822511334, "username": "管理员" };

var CaseSubTypeList =
    {
    "市容环境": "私搭乱建,暴露垃圾,无主积存建筑垃圾,道路不洁,河道不洁,绿地脏乱,废弃车辆,非装饰性树挂,餐饮业油烟,河堤破损,废弃家具设备,线杆无序吊挂,树木毁坏,道路破损,水域秩序问题,户外乱挂晒,毁绿占绿,路面杂草,在公共区域种菜,地钉、残桩、坑洞,交通隔离栏不洁,绿植遮挡,焚烧垃圾,生活垃圾运输车,垃圾容器未盖,内涝,其它市容环境问题",
    "宣传广告": "非法张贴、涂写小广告,违章设置户外广告设施,违章设置气模、拱门,街头散发小广告,公益广告牌脏、破损,广告设施脏、破损,告示栏脏、破损,灯杆广告、彩旗,条幅广告,其它宣传广告问题",
    "施工管理": "车辆撒漏或车轮带泥污染城市道路,市政施工管理,擅自挖掘城市道路,违章处置建筑垃圾,工地施工管理,其它施工管理问题",
    "突发事件": "路面塌陷,自来水管破裂,燃气管道破裂,雨水下水道堵塞,污水漫溢,重大危险源,群发性事件,道路表面结冰,其它突发事件",
    "街面秩序": "无证占道摆卖,流浪乞讨,占道废品收购,跨门槛经营,在车行道上乱停放机动车,在人行道上违章停放机动车,乱堆物料,“三车”管理,露天烧烤,固定门面内洗车点,文化市场管理,经营性露天演出,液化石油气无证经营,公交车辆不按规范停靠站点,在人行道上无序停放非机动车,露天洗车场（点）,露天无证歌摊,在车行道上乱停放非机动车,在“门前三包”范围乱停机动车,在“门前三包”范围乱停非机动车,在绿地违章停放机动车,在绿地违章停放非机动车,停车位管理,共享单车乱停放,共享单车破损,其它街面秩序问题",
    "其它": "鼠迹,防鼠设施设置,鼠类,蝇类孳生地,防蝇设施设置,蝇类,蟑迹,防蟑设施设置,蟑螂,蚊类孳生地,防蚊设施设置,成蚊",
    "扬尘专项":"消纳场管理,道路驳接口管理,堆场管理,采石场管理,运输车辆管理,储备土地管理"
};
var PartSubTypeList =
{
    "公共设施": "私搭乱建,暴露垃圾,无主积存建筑垃圾,道路不洁,河道不洁,绿地脏乱,废弃车辆,非装饰性树挂,餐饮业油烟,河堤破损,废弃家具设备,线杆无序吊挂,树木毁坏,道路破损,水域秩序问题,户外乱挂晒,毁绿占绿,路面杂草,在公共区域种菜,地钉、残桩、坑洞,交通隔离栏不洁,绿植遮挡,焚烧垃圾,生活垃圾运输车,垃圾容器未盖,内涝,其它市容环境问题",
    "道路交通": "非法张贴、涂写小广告,违章设置户外广告设施,违章设置气模、拱门,街头散发小广告,公益广告牌脏、破损,广告设施脏、破损,告示栏脏、破损,灯杆广告、彩旗,条幅广告,其它宣传广告问题",
    "市容环境": "车辆撒漏或车轮带泥污染城市道路,市政施工管理,擅自挖掘城市道路,违章处置建筑垃圾,工地施工管理,其它施工管理问题",
    "园林绿化": "路面塌陷,自来水管破裂,燃气管道破裂,雨水下水道堵塞,污水漫溢,重大危险源,群发性事件,道路表面结冰,其它突发事件",
    "房屋土地": "无证占道摆卖,流浪乞讨,占道废品收购,跨门槛经营,在车行道上乱停放机动车,在人行道上违章停放机动车,乱堆物料,“三车”管理,露天烧烤,固定门面内洗车点,文化市场管理,经营性露天演出,液化石油气无证经营,公交车辆不按规范停靠站点,在人行道上无序停放非机动车,露天洗车场（点）,露天无证歌摊,在车行道上乱停放非机动车,在“门前三包”范围乱停机动车,在“门前三包”范围乱停非机动车,在绿地违章停放机动车,在绿地违章停放非机动车,停车位管理,共享单车乱停放,共享单车破损,其它街面秩序问题",
    "其它设施": "鼠迹,防鼠设施设置,鼠类,蝇类孳生地,防蝇设施设置,蝇类,蟑迹,防蟑设施设置,蟑螂,蚊类孳生地,防蚊设施设置,成蚊",
    "扩展部件": "消纳场管理,道路驳接口管理,堆场管理,采石场管理,运输车辆管理,储备土地管理"
};
var CaseTypeList = { keys: ["市容环境", "宣传广告", "施工管理", "突发事件", "街面秩序", "其它", "扬尘专项"], detial: CaseSubTypeList};
var PartTypeList = { keys: ["公共设施", "道路交通", "市容环境", "园林绿化", "房屋土地", "其它设施", "扩展部件"], detial: PartSubTypeList };
var CaseBigTypeList = { "事件类": CaseTypeList, "部件类": PartTypeList };

function GetTypeList(bigType)
{
    var data = [];
    for (var i = 0; i < CaseBigTypeList[bigType].keys.length; i++)
    {
        data[i] = { id: CaseBigTypeList[bigType].keys[i]};
    }
    return data;
}

function GetSubTypeList(bigType,type) {
    var data = [];
    var d = CaseBigTypeList[bigType].detial[type].split(',');
    for (var i = 0; i < d.length; i++) {
        data[i] = { id: d[i] };
    }
    return data;
}

